[
  {
  "work_name": "Analog Devices S.L.U.",
  "work_location": "Valencia, España",
  "work_place": "Ingeniero de APIs",
  "work_time": "Enero 2022 - Actualmente",
  "description": [
    "Desarrollo de un dashboard de frontend para control general del sistema.",
    "Desarrollo de APIs contenerizadas que proveen funcionalidad tanto al frontend como a varios servicios del sistema.",
    "Despliegue y control de aplicaciones contenerizadas en Kubernetes."
  ]
  },
  {
    "work_name": "NODEL",
    "work_location": "Guayaquil, Ecuador",
    "work_place": "Ingeniero de APIs y datos",
    "work_time": "Enero 2021 - Noviembre 2021",
    "description": [
      "Administrar procesos ETL usando Databricks.",
      "Descarga y preprocesamiento de datos usando técnicas de scrapping y APIs de terceros.",
      "Administrador de infraestructura en AWS."
    ]
  },
  {
    "work_name": "Shippify",
    "work_location": "Guayaquil, Ecuador",
    "work_place": "Ingeniero de APIs",
    "work_time": "Marzo 2019 - Marzo 2020",
    "description": [
      "Migrar parte de la API de Shippify usada desde su aplicación móvil a una arquitectura AWS lambda",
      "Implementar una arquitectura para consumir eventos en tiempo real que provienen de una base de datos, fluyen a través de Kafka y finalmente son procesados en varias funciones Lambdas",
      "Encargado de integraciones con compañias como Amazon Brasil y Laar Courier en Ecuador"
    ]
  },
  {
    "work_name": "Soluciones Tecnológicas PuntoEC",
    "work_location": "Guayaquil, Ecuador",
    "work_place": "Director de tecnología",
    "work_time": "Marzo 2017 - Mayo 2021",
    "description": [
      "Analizar varias tecnología y diseñar un plan de desarrollo a seguir en cada uno de los proyectos de la empresa",
      "Diseñar y administrar las bases de datos (MySQL)",
      "Diseñar arquitecturas robustas y tolerante a fallos para un sistema de emisión de documentos electrónicos para el departamento de hacienda en Ecuador",
      "Co-creador y desarrollador de software médico llamado PuntoMed",
      "Co-creador y desarrollador de software para facturación electrónica llamado PuntoDoc"
    ]
  },
  {
    "work_name": "Centro de Tecnologías de la información (ESPOL)",
    "work_location": "Guayaquil, Ecuador",
    "work_place": "Desarrollador",
    "work_time": "Febrero 2016 - Marzo 2017",
    "description": [
      "Desarrollador senior en proyecto financiado por la secretaría de ciencia y tecnología de Ecuador llamado Makitouch",
      "Desarrollo e implementación de un algoritmo para detección de la yema de los dedos en C++",
      "Diseño de un prototipo de hardware usando Kinect V2 como un sensor de profundidad"
    ]
  },
  {
    "work_name": "Centro de Tecnologías de la información (ESPOL)",
    "work_location": "Guayaquil, Ecuador",
    "work_place": "Asistente de investigación",
    "work_time": "Octubre 2014 - Febrero 2016",
    "description": [
      "Mejorar y actualizar varias proyetos del centro de investigación escritos en Java, Javascript y Python",
      "Crear una aplicación para pantallas táctiles usando framework Kivy (Python)",
      "Administrar y actualizar servidores web, en su mayoría basados en sistemas Linux"
    ]
  },
  {
    "work_name": "Escuela Superior Politécnica del Litoral (ESPOL)",
    "work_location": "Guayaquil, Ecuador",
    "work_place": "Asistente de enseñanaza",
    "work_time": "Marzo 2014 - Septiembre 2014",
    "description": [
      "Asistente de enseñanza para la clase de Organización y Arquitectura de Computadores de la carrera de ciencias computacionales en ESPOL",
      "Formular y evaluar el proyecto final de la clase",
      "Formulación y resolución de problemas para reforzar temas vistos en la clase"
    ]
  }
]